    program msln_
! Тест подпрограммы msln(ip,aa,aw,s,dL,dC)
! MSLN - Microstrip Coupled Lines, N-strip 
! МСМПЛ - Многопроводные связанные микрополосковые линии
    implicit complex*16(c,w,z), real*8(a-b,d-h,o-v,x-y)
    dimension aa(5), aw(9), s(8)			 ! Nmax=9. Максимальное число линий = 9. 
    dimension bC(81), dC(81), dCC(81), dL(81), Um(81), em(9), v(9)
	real*8 Im(81),Zo(81)

    data aw/9*1./ ! вектор ширин микрополосквых линий (мм)
	data s /8*1./ ! вектор межлинейных зазоров (мм)

	n=1; t=0.05;  h1=1.;  e1=10.; e2=1. ! Всегда д.б.: e1>e2 !!!
!  n=2; t=0.035;  h1=5;  e1=10.; e2=1. ! Всегда д.б.: e1>e2 !!!
 n=3; aw(1)=1.;aw(2)=1.;aw(3)=2.;s(1)=.5;s(2)=1.;t=0.05;  h1=1.; e1=10.;  e2=1 ! Рим'14_1
! n=3; aw(1)=60;aw(2)=60;aw(3)=60; s(1)=10;s(2)=10; t=1.4; h1=60; e1=4.65; e2=1 ! Рим'14_2
! n=5; aw(1)=3;aw(2)=3;aw(3)=3;aw(4)=3;aw(5)=3;s(1)=2;s(2)=2;s(3)=2;s(4)=2;t=1;h1=1;e1=2;e2=1 !? Рим'14_3
! n=4; aw(1)=.15;aw(2)=.15;aw(3)=.15;aw(4)=.15;s(1)=.1;s(2)=.1;s(3)=.1;t=.018; h=1;e1=10;e2=1 !? Ланге

! data aw/2.4,1.8,2.7/, s/.2,.4/; n=3; t=0.005; h1=2; e1=2.5;  ! Вольман 1'82
! data aw/.61,.61,.61/, s/.3,.3/; n=3; t=0.035; h1=1; e1=9.68; ! Вольман 2'82
! data aw/.4,.1/,  s /.02/;  n=2;  t=0.035;  h1=.1;  e1=10;    !? IEEE MTT-43 1995 N2
! data aw/2.5,2.5/, s/.1 /;  n=2;  t=0.035;  h1=1.5;  e1=5;    ! Газизов 2016, s=.02,L= 4.3дБ, s=.1,L=7.56дБ
! data aw/1.,1.,2./, s/.5,1./;  n=3;  t=0.05; h1=1;  e1=10.;   ! Рим 1'14  
! data aw/60,60,60/, s/10,10/;  n=3;  t=1.4;  h1=60;  e1=4.65; ! Рим 2'14
! data aw/3,3,3,3,3/, s/2,2,2,2/;  n=5;  t=1; h1=1;   e1=2.;   !? Рим 3'14  -- трудное
! data aw/.074,.074,.074,.074/, s/.079,.079,.079/;  n=4;  t=.01; h1=1; e1=9.6 !?"Тэхника",Киев,1990 немного не совпад с MSLN.m	data aw/0.44/; n=1; t=0.035; h=0.2; e=3.38;  ! Микрополоска на RO4003  2016.04.17
! data aw/.0326,.175,.0326/, s/.0225,.0225/; n=3; t=0.001; h1=.5; e1=10.; !? Силин Антенны'87 2017.01.02 
! data aw/.9,.9/,   s/.8/;  n=2;  t=0.05; h1=1;  e1=10.;        ! Нюрнберг'13 (д.б. 6.54/5.25  61.3/42.2ом)  
! data aw/.48,.48/, s/.128/;  n=2;  t=0.001; h1=.635;  e1=9.7;  ! Сергеев'02, стр.12 (6.8/5.48  74.77/34.22ом  8,6дБ/50,6ом)  
! data aw/1.,3./, s/1.5/;  n=2;  t=0.035; h1=1.0;  e1=10.;      ! Тест неодинак. (6.9/6.3  -1.01/1.645  17дБ/24.5ом)  
! data aw/1.,1./, s/1./;  n=2;  t=0.035; h1=1.0;  e1=10.;       ! Тест одинак. (6.9/6.3  -1.01/1.645  17дБ/24.5ом)  

	
!	Исходные данные:
	aa(1) = n 	! количество микрополосквых линий передачи n
    aa(2) = h1 	! толщина диэлектрической подложки h1(мм)
	aa(3) = t 	! толщина микрополосковых линий t(мм)
    aa(4) = e1 	! диэл.проницаем. диэлектрической подложки e1
	aa(5) = e2 	! диэл.проницаем. верхней окруж.среды e2
!	aw(9) = aw(9) ! ширины полосок (линий) на подложке w(мм)
!	 s(8) = s(8)  ! зазоры между полосками s(мм)

!==============================================================================
! Контрольная печать исходных данных (коорд.многоугольника)
    print*,'Input MSLN:'; 
	write(*,'('' w'',i1,'' ='',f8.3)')(i, aw(i),i=1,n); 
	write(*,'('' s'',i1,'' ='',f8.3)')(i, s(i),i=1,n-1);
	write(*,1) ,h1,t,e1,e2
1   format(' h =',f5.2,'  t=',f5.3/' e1 =',f5.2,'  e2 =',f5.2/)
!==============================================================================
!	ip=0 ! Индекс печати = -2,-1,0,1.	Если ip=0, всё печат. 
!		   ip=iprint.					Если ip=-2, ничего не печат. 
   ip=-2

	call  msln(ip,aa,aw,s,dL,dC)  ! Обращение к подпрограмме

	print*,'Capacitance matrix [C] (pF/m)'; call DPRINT(dC, n)
    print*,'Inductance matrix [L] (uH/m)';  call DPRINT(dL, n)
	call dminv(dL,n,ad)
! Модальные диэлектрические проницаемости em и модальные напряжения Um
		dCC=dC		! Для сохранения dC после работы NROOT(n,dC,bC,em,Um)
	call nroot(n,dCC,11.127*dL,em,Um)
	print*,'Modal voltage matrix [Um] (V)'; call DPRINT(Um, n)
    print*,'Modal dielectric permitivities [Em]' 
	do i =1,n; print '(f8.2)',em(i); enddo; 
	call impedance(n,dC,em,Um,Zo)	
    print'(/'' Impedance matrix Zo'')'; call dprint(Zo,n)
!--------------------------------------------------------------------------
	end